Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Replace Method (Int32, LineSegment)
 Replaces the geometry at a given index
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder Replace(
	int index,
	LineSegment segment
)
Public Function Replace (
	index As Integer,
	segment As LineSegment
) As PolycurveGeometryBuilder
Parameters
index
Type: System.Int32
Index of the geometry to replace
segment
Type: Tekla.Structures.Geometry3d.LineSegment
Geometry to insert in place of the existing one
Return Value
Type: PolycurveGeometryBuilder
The builder itself
See Also
Reference
PolycurveGeometryBuilder Class
Replace Overload
Tekla.Structures.Geometry3d Namespace